# Write a Pandas program to convert all the string values to upper, lower cases in a given pandas series. Also find the length of the string values.

In [1]:
import pandas as pd
import numpy as np
s = pd.Series(['X', 'Y', 'Z', 'Aaba', 'Baca', np.nan, 'CABA', None, 'bird', 'horse', 'dog'])
print("Original series:")
print(s)

Original series:
0         X
1         Y
2         Z
3      Aaba
4      Baca
5       NaN
6      CABA
7      None
8      bird
9     horse
10      dog
dtype: object

In [2]:
print("\nConvert all string values of the said Series to upper case:")
print (s.str.upper())

Convert all string values of the said Series to upper case:
0         X
1         Y
2         Z
3      AABA
4      BACA
5       NaN
6      CABA
7      None
8      BIRD
9     HORSE
10      DOG
dtype: object

In [3]:
print("\nConvert all string values of the said Series to Lower case:")
print (s.str.lower())

Convert all string values of the said Series to Lower case:
0         x
1         y
2         z
3      aaba
4      baca
5       NaN
6      caba
7      None
8      bird
9     horse
10      dog
dtype: object

In [5]:
print("\nLength of the string values of the said Series:")
print (s.str.len())

Length of the string values of the said Series:
0     1.0
1     1.0
2     1.0
3     4.0
4     4.0
5     NaN
6     4.0
7     NaN
8     4.0
9     5.0
10    3.0
dtype: float64

# Write a Pandas program to remove whitespaces, left sided whitespaces and right sided whitespaces of the string values of a given pandas series.

In [6]:
import pandas as pd
color1 = pd.Index([' Green', 'Black ', ' Red ', 'White', ' Pink '])

In [8]:
print(color1)

Index([' Green', 'Black ', ' Red ', 'White', ' Pink '], dtype='object')

In [9]:
print("\nRemove whitespace")
print(color1.str.strip())

Remove whitespace
Index(['Green', 'Black', 'Red', 'White', 'Pink'], dtype='object')

In [10]:
print("\nRemove left sided whitespace")
print(color1.str.lstrip())

Remove left sided whitespace
Index(['Green', 'Black ', 'Red ', 'White', 'Pink '], dtype='object')

In [11]:
print("\nRemove right sided whitespace")
print(color1.str.rstrip())

Remove right sided whitespace
Index([' Green', 'Black', ' Red', 'White', ' Pink'], dtype='object')

# Write a Pandas program to add leading zeros to the integer column in a pandas series and makes the length of the field to 8 digit

In [12]:
import pandas as pd
nums = {'amount': [10, 250, 3000, 40000, 500000]}

In [14]:
df=pd.DataFrame(nums)
df

   amount
0      10
1     250
2    3000
3   40000
4  500000

In [18]:
print("\nAdd leading zeros:")
df['amount']=df['amount'].apply(lambda a: '{0:0>8}'.format(a))
df

Add leading zeros:

     amount
0  00000010
1  00000250
2  00003000
3  00040000
4  00500000

# Write a Pandas program to capitalize all the string values of specified columns of a given DataFrame.

In [27]:
import pandas as pd
df = pd.DataFrame({
    'name': ['alberto','gino','ryan', 'Eesha', 'syed'],
    'date_of_birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})

In [28]:
print("original Dataframe")
df

original Dataframe

      name date_of_birth    age
0  alberto     17/05/2002  18.5
1     gino     16/02/1999  21.2
2     ryan     25/09/1998  22.5
3    Eesha     11/05/2002  22.0
4     syed     15/09/1997  23.0

In [29]:
df['name']= list(map(lambda x: x.capitalize(),df['name']))

In [30]:
df

      name date_of_birth    age
0  Alberto     17/05/2002  18.5
1     Gino     16/02/1999  21.2
2     Ryan     25/09/1998  22.5
3    Eesha     11/05/2002  22.0
4     Syed     15/09/1997  23.0

In [31]:
import pandas as pd
df = pd.DataFrame({
    'name_code': ['c001','c002','c022', 'c2002', 'c2222'],
    'date_of_birth ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'age': [18.5, 21.2, 22.5, 22, 23]
})
print("Original DataFrame:")
print(df)
print("\nCount occurrence of 22 in date_of_birth column:")
df['Index'] = list(map(lambda x: x.find('22'), df['name_code']))
print(df)

Original DataFrame:
  name_code date_of_birth    age
0      c001     12/05/2002  18.5
1      c002     16/02/1999  21.2
2      c022     25/09/1998  22.5
3     c2002     12/02/2022  22.0
4     c2222     15/09/1997  23.0

Count occurrence of 22 in date_of_birth column:
  name_code date_of_birth    age  Index
0      c001     12/05/2002  18.5     -1
1      c002     16/02/1999  21.2     -1
2      c022     25/09/1998  22.5      2
3     c2002     12/02/2022  22.0     -1
4     c2222     15/09/1997  23.0      1